Revit 2027 API
SpacingRule.SetLayoutMaximumSpacing Method
Set the Layout property to MaximumSpacing.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetLayoutMaximumSpacing(
	double distance,
	SpacingRuleJustification just,
	double gridlinesRotation,
	double offset
)
Public Sub SetLayoutMaximumSpacing (
	distance As Double,
	just As SpacingRuleJustification,
	gridlinesRotation As Double,
	offset As Double
)
public:
void SetLayoutMaximumSpacing(
	double distance,
	SpacingRuleJustification just,
	double gridlinesRotation,
	double offset
)
member SetLayoutMaximumSpacing :
        distance : float *
        just : SpacingRuleJustification *
        gridlinesRotation : float *
        offset : float -> unit
Parameters
distance Double
just SpacingRuleJustification
gridlinesRotation Double
offset Double
Remarks
When changing the Layout to MaximumSpacing, you must also simultaneously set the Distance, Justification, GridlinesRotation, and Offset properties.
See Also
Reference
SpacingRule Class
Autodesk.Revit.DB Namespace